In [1]:
import pandas as pd
import numpy as np

In [2]:
u1 = pd.read_csv('use_log.csv')
cust_m = pd.read_csv('customer_master.csv')
class_m = pd.read_csv('class_master.csv')
camp_m = pd.read_csv('campaign_master.csv')

- use_log : 이용 이력 데이터
- cust_m : 회원정보 데이터 - 탈퇴한 회원을 포함한 모든 회원에 대한 정보(enddate가 비워져있으면 탈퇴하지 않은 회원)
- class_m : 회원구분 데이터 (종일/주간/야간)
- camp_m : 프로모션 행사 구분 데이터(무료/ 반액할인/ 일반권)

In [3]:
display(u1.head(),cust_m.head(),class_m.head(),camp_m.head())

            log_id customer_id     usedate
0  L00000049012330    AS009373  2018-04-01
1  L00000049012331    AS015315  2018-04-01
2  L00000049012332    AS040841  2018-04-01
3  L00000049012333    AS046594  2018-04-01
4  L00000049012334    AS073285  2018-04-01

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0

  class class_name  price
0   C01       0_종일  10500
1   C02       1_주간   7500
2   C03       2_야간   6000

  campaign_id campaign_name
0         CA1          2_일반
1         CA2     0_입회비반액할인
2         CA3       1_입회비무료

In [4]:
# 고객현황 data인 cust_m에 data를 결합하여 새로운 dataframe 생성
cust_join = pd.merge(cust_m, class_m, on='class', how='left')
cust_join

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0,2_야간,6000
...,...,...,...,...,...,...,...,...,...,...
4187,HD676663,XXXX,C01,M,2019-03-14 00:00:00,NaN,CA1,0,0_종일,10500
4188,HD246549,XXXXX,C01,F,2019-03-14 00:00:00,NaN,CA1,0,0_종일,10500
4189,GD037007,XXXXX,C03,M,2019-03-14 00:00:00,NaN,CA1,0,2_야간,6000
4190,OA953150,XXXXX,C01,M,2019-03-14 00:00:00,NaN,CA1,0,0_종일,10500
4191,IK692635,XXXXX,C02,F,2019-03-15 00:00:00,NaN,CA1,0,1_주간,7500

In [5]:
cust_join = pd.merge(cust_join,camp_m, on='campaign_id', how='left')
cust_join.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0,2_야간,6000,2_일반

In [6]:
# 공통칼럼 기준으로 잘 합쳐졌는지 확인
print(len(cust_m))
print(len(cust_join))

4192
4192

In [7]:
cust_join.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4192 entries, 0 to 4191
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    4192 non-null   object
 1   name           4192 non-null   object
 2   class          4192 non-null   object
 3   gender         4192 non-null   object
 4   start_date     4192 non-null   object
 5   end_date       1350 non-null   object
 6   campaign_id    4192 non-null   object
 7   is_deleted     4192 non-null   int64
 8   class_name     4192 non-null   object
 9   price          4192 non-null   int64
 10  campaign_name  4192 non-null   object
dtypes: int64(2), object(9)
memory usage: 393.0+ KB

In [8]:
cust_join.isnull().sum()

customer_id         0
name                0
class               0
gender              0
start_date          0
end_date         2842
campaign_id         0
is_deleted          0
class_name          0
price               0
campaign_name       0
dtype: int64

- 결측치를 확인하는 이유는 결합할 때 키가 없거나 결합이 잘못되면 자동으로 결측치가 들어가기 때문
    -> 결합 후에는 결측치를 확인해주는게 좋음
- 원래 결측치가 있던 end_date에만 결측치가 있으므로 data가 잘 들어가져있다라고 확인

In [9]:
cust_join['customer_id'].nunique()  # unique값의 수 확인

4192

#### cust_join dataframe 분석

어떤 궁금에 대해 data를 뽑아낼지
- 어떤 종류의 회원이 있는지
- 어떤 캠페인으로 많이 가입했는지
- 언제 가입/탈퇴 회원이 많은지
- 남여 비율
- 탈퇴한 회원들은 얼마큼의 기간동안 스포츠센터를 다녔는지

In [10]:
cust_join.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaN,CA1,0,0_종일,10500,2_일반
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaN,CA1,0,2_야간,6000,2_일반

In [11]:
cust_join.class_name.value_counts()

0_종일    2045
2_야간    1128
1_주간    1019
Name: class_name, dtype: int64

In [12]:
cust_join.groupby('class_name')['customer_id'].count()

class_name
0_종일    2045
1_주간    1019
2_야간    1128
Name: customer_id, dtype: int64

In [13]:
# 회원권 종류별로 비율 확인
round(cust_join.groupby('class_name')['customer_id'].count()*100 / cust_join.shape[0], 1)   # 소수점 처리

class_name
0_종일    48.8
1_주간    24.3
2_야간    26.9
Name: customer_id, dtype: float64

In [14]:
# 프로모션 현황 비율 확인
round(cust_join.groupby('campaign_name')['customer_id'].count()*100 / cust_join.shape[0], 1)

campaign_name
0_입회비반액할인    15.5
1_입회비무료      11.7
2_일반         72.8
Name: customer_id, dtype: float64

In [15]:
# 성별 현황
print('성별 현황 \n', cust_join.gender.value_counts())
# 성별 비율
print('성별 비율 \n', round(cust_join.groupby('gender')['customer_id'].count()*100 / cust_join.shape[0]), 1)

성별 현황
 M    2209
F    1983
Name: gender, dtype: int64
성별 비율
 gender
F    47.0
M    53.0
Name: customer_id, dtype: float64 1

In [16]:
# 탈퇴자 현황
print('탈퇴자 현황 \n', cust_join.is_deleted.value_counts())
# 탈퇴자 비율
print('탈퇴자 비율 \n', round(cust_join.groupby('is_deleted')['customer_id'].count()*100 / cust_join.shape[0]), 1)

탈퇴자 현황
 0    2842
1    1350
Name: is_deleted, dtype: int64
탈퇴자 비율
 is_deleted
0    68.0
1    32.0
Name: customer_id, dtype: float64 1

- 남자가 더 많이 가입한 이유??
- 탈퇴한 사람들은 왜 탈퇴?? (프로모션만 이용??)

### data를 조건별로 뽑아보기
최신데이터
 - 2019.3 이용자 뽑기 -> end-data가 2019.3.31 이후거나 탈퇴한 적이 없어야 함

In [17]:
cust_join['end_date'] = pd.to_datetime(cust_join['end_date'])
cust_new = cust_join[(cust_join['end_date']>=pd.to_datetime('20190331'))|(cust_join['end_date'].isnull())]
cust_new.head()

,customer_id,name,class,gender,start_date,end_date,campaign_id,is_deleted,class_name,price,campaign_name
0,OA832399,XXXX,C01,F,2015-05-01 00:00:00,NaT,CA1,0,0_종일,10500,2_일반
1,PL270116,XXXXX,C01,M,2015-05-01 00:00:00,NaT,CA1,0,0_종일,10500,2_일반
2,OA974876,XXXXX,C01,M,2015-05-01 00:00:00,NaT,CA1,0,0_종일,10500,2_일반
3,HD024127,XXXXX,C01,F,2015-05-01 00:00:00,NaT,CA1,0,0_종일,10500,2_일반
4,HD661448,XXXXX,C03,F,2015-05-01 00:00:00,NaT,CA1,0,2_야간,6000,2_일반

In [18]:
cust_new['end_date'].unique()

array([                          'NaT', '2019-03-31T00:00:00.000000000'],
      dtype='datetime64[ns]')

In [19]:
# 어떤 회원권을 많이 사용하고 있는지 확인
cust_new.groupby('class_name')['customer_id'].count()

class_name
0_종일    1444
1_주간     696
2_야간     813
Name: customer_id, dtype: int64

In [20]:
round((cust_new.groupby('class_name')['customer_id'].count()*100 / cust_new.shape[0]), 1)

class_name
0_종일    48.9
1_주간    23.6
2_야간    27.5
Name: customer_id, dtype: float64

In [21]:
# 성별 비율 확인
round((cust_new.groupby('gender')['customer_id'].count()*100 / cust_new.shape[0]), 1)

gender
F    47.4
M    52.6
Name: customer_id, dtype: float64

In [22]:
# 프로모션 비율 확인
round((cust_new.groupby('campaign_name')['customer_id'].count()*100 / cust_new.shape[0]), 1)

campaign_name
0_입회비반액할인    10.5
1_입회비무료       8.2
2_일반         81.3
Name: customer_id, dtype: float64